{"subjectLine":"[foaf-dev] Fwd: [StatusNet-dev] User Karma","fromName":"Melvin Carvalho","messageText":"\n> statusnet / identi.ca list...\n\nNice post.  Not sure about their algorithm but site specific karma /\npoints / thanks system is generally a good thing (I have experienced\nthis in various bulletin board systems, and find it quite positive).\nReminds me also of your post on egobanks.\n\nObviously as identi.ca have FOAFs already, it would be ideal for users\nto have their karma as part of their FOAF, and therefore linked data\nprofile, and consequently online reputation (non-spammer).\n\nDo you think we can model this and put it out as part of the next FOAF spec?\n\n> Dan\n>\n>\n>\n> Begin forwarded message:\n>\n> From: Jon Phillips <jon at status.net>\n> Date: 27 November 2009 06:35:33 CET\n> To: Christopher Vollick <chris at controlyourself.ca>\n> Cc: statusnet-dev <statusnet-dev at lists.status.net>\n> Subject: Re: [StatusNet-dev] User Karma\n>\n> <toppost />\n>\n> This is super cool!\n>\n> I wrote-up a high level spec of what I'd like to see with karma in allowing\n> people to track different types of karma, similar to some bots:\n>\n> http://rejon.org/wiki/IDEA_20090906_Identica_Karma\n>\n> I like that your system is to be used for spam control, etc, but hey, we\n> should just start the global karma from 0, and allow for users to give karma\n> themselves.\n>\n> Also, hey, gaming the system, might allow for some cool results, depending\n> upon how its gamed. Of course, a scenario where the spammers can game a\n> system like I describe, might put us right back in the same boat, but still\n> interesting.\n>\n> Curious your thoughts on what I propose and how your system might be adapted\n> for this usage.\n>\n> My real intent is to use karma as a type of point system or game/task\n> system, a way to drive traffic and interest.\n>\n> Jon\n>\n> On Thu, Nov 26, 2009 at 7:39 AM, Christopher Vollick\n> <chris at controlyourself.ca> wrote:\n>>\n>> ** This email gets kind of long, rambley, and a little bit technical. Read\n>> as much of it as you like, and feel free to ignore the rest **\n>>\n>> So, today I woke up and felt like writing a User Karma thing.\n>> So, I did:\n>> http://gitorious.org/~cvollick/statusnet/cvollicks-clone/commits/karma\n>>\n>> It's intended to be for Spam Things.\n>>\n>> The way it currently works is this:\n>> When User A subscribes to User B, User B's Karma increases by 1/10th of\n>> User A's (Assuming it's positive), by default.\n>> When they unsubscribe again those points are by default removed.\n>>\n>> The same when one of their notices gets faved.\n>>\n>> When a user gets blocked their Karma goes down by 1/10th of User A's.\n>>\n>> When a user gets blocked by a group it's 1/50th the blocking user's karma.\n>> I did this because I figured that people are more likely to be blocked by\n>> a group for legitimate reasons that to be blocked by people.\n>>\n>> This required adding some more Events.\n>> Having added 4 or so of then in occasionally questionable ways, I feel\n>> like there might be a better way.\n>>\n>> I've capped Karma at -1000 and 1000.\n>> This was so that popular people like Evan and BUGabundo don't end up with,\n>> like, 1 500 000 000 karma.\n>> Then, with a single fave one of you Titans would descend from Heaven and\n>> give but a taste of your power to mortals who amuse you.\n>> Or, I feel bad for the person who one of the Titans decides to block, and\n>> completely destroys their account.\n>> Anyway....\n>>\n>>\n>> So, the \"Karma\" plugin is just infrastructure, it only maintains Karma,\n>> but doesn't do anything with it.\n>> So, I wrote \"KarmaModerator\" to demonstrate my vision for Karma.\n>> KarmaModerator is a second plugin that emulates sandboxing a user when\n>> their karma drops below 0 and emulates silencing a user when their karma\n>> drops below -500.\n>> At no point does it autodelete their account, but it would put them out of\n>> commission until they can be dealt with.\n>> I could have used normal silence and sandbox, but I didn't want to\n>> interfere with the other methods of sandboxing and silencing.\n>> That could have been the wrong thing to do, time (And Evan) will tell.\n>>\n>>\n>> I tried to make a system that was not gameable.\n>> As a result, there isn't really any boot strapping.\n>> There is nothing that you should be able to do that generates Karma out of\n>> nowhere. It's all currently dependent on existing karma.\n>> This was so that newly created accounts aren't capable of wrecking things.\n>> In this system, I'll admit, if a spammer were ever able to get a\n>> significant amount of power somehow, he could do some damage to the lesser\n>> mortals.\n>> It would take a concerted effort of might to bring down one of the Titans,\n>> though.\n>> With the 1000 cap, it would take 10 people all with 1000 points blocking\n>> someone with 1000 points to even get them blacklisted.\n>> Currently nothing costs.\n>> It's possible that something like blocking requires spending Karma.\n>> I decided against that for now.\n>>\n>> Back to bootstrapping:\n>> So, I'm planning on writing a script that takes the existing system and\n>> generates a rough Karma for existing accounts based on a few initial values.\n>> For example, it's probably be like \"Take the top 10 most popular accounts\n>> and give them each max karma. Now, pretend that they all just started\n>> following all the people they're following. Then pretend that they all just\n>> started blocking everyone they've blocked. Pretend they've all just faved\n>> all the things they've faved.\"\n>> That'd probably generate some fairly fair scores off the bat, and the\n>> system can take over from there with everyone else.\n>>\n>> Also, there are currently ways to game the system kind.\n>> Of course, two people could fave all of each other's notices in turn\n>> gaining popularity slowly. (This is only possible once they have over 10\n>> karma)\n>> A lot of the gaming I've considered involves a chain of following and\n>> unfollowing.\n>> I considered writing another Plugin that would implement a history for\n>> this, so once I follow someone my Karma will be snapshot and any time I\n>> follow or unfollow them it will be that value.\n>> This is to fix an issue I considered where I start an account and follow\n>> someone, giving them 0/10, or 0 points.\n>> Then I become popular, and then when I decide to unfollow them, perhaps\n>> with no ill intentions, it reduces their karma by 1000/10, or 100.\n>>\n>> Currently it's my feeling that only Moderators should be able to even see\n>> Karma.\n>> Other than that it's just a hidden value that most people don't even\n>> really know about.\n>> This makes it harder to game, because you can't see your progress.\n>>\n>> Anyway, this is just the first iteration.\n>> I mostly just wanted to write it, so I did.\n>>\n>> There are probably far better ways of doing most of the things I did, but\n>> it's always easier to augment then to create.\n>>\n>> So, what do you think?\n>> _______________________________________________\n>> StatusNet-dev mailing list\n>> StatusNet-dev at lists.status.net\n>> http://lists.status.net/mailman/listinfo/statusnet-dev\n>\n>\n>\n> --\n> Jon Phillips\n> http://rejon.org/\n> +1.415.830.3884 (sf/global)\n> +86.134.3957.2035 (china)\n> Sent from Ho Chi Minh City, Vietnam\n>\n> _______________________________________________\n> StatusNet-dev mailing list\n> StatusNet-dev at lists.status.net\n> http://lists.status.net/mailman/listinfo/statusnet-dev\n>\n> _______________________________________________\n> foaf-dev mailing list\n> foaf-dev at lists.foaf-project.org\n> http://lists.foaf-project.org/mailman/listinfo/foaf-dev\n>"}