{"subjectLine":"[foaf-dev] Fwd: [StatusNet-dev] User Karma","fromName":"Melvin Carvalho","messageText":"> statusnet / identi.ca list...\n\nNice post.  Not sure about their algorithm but site specific karma /\npoints / thanks system is generally a good thing (I have experienced\nthis in various bulletin board systems, and find it quite positive).\nReminds me also of your post on egobanks.\n\nObviously as identi.ca have FOAFs already, it would be ideal for users\nto have their karma as part of their FOAF, and therefore linked data\nprofile, and consequently online reputation (non-spammer).\n\nDo you think we can model this and put it out as part of the next FOAF spec?\n\n>\n>\n>\n> Date: 27 November 2009 06:35:33 CET\n> Cc: statusnet-dev <statusnet-dev at lists.status.net>\n>\n>\n>\n> people to track different types of karma, similar to some bots:\n> http://rejon.org/wiki/IDEA_20090906_Identica_Karma\n> I like that your system is to be used for spam control, etc, but hey, we\n> themselves.\n> Also, hey, gaming the system, might allow for some cool results, depending\n> system like I describe, might put us right back in the same boat, but still\n>\n> for this usage.\n> My real intent is to use karma as a type of point system or game/task\n>\n>\n> <chris at controlyourself.ca> wrote:\n>> ** This email gets kind of long, rambley, and a little bit technical. Read\n>>\n>> So, I did:\n>>\n>>\n>> When User A subscribes to User B, User B's Karma increases by 1/10th of\n>> When they unsubscribe again those points are by default removed.\n>> The same when one of their notices gets faved.\n>> When a user gets blocked their Karma goes down by 1/10th of User A's.\n>> When a user gets blocked by a group it's 1/50th the blocking user's karma.\n>> a group for legitimate reasons that to be blocked by people.\n>> This required adding some more Events.\n>> like there might be a better way.\n>> I've capped Karma at -1000 and 1000.\n>> like, 1 500 000 000 karma.\n>> give but a taste of your power to mortals who amuse you.\n>> completely destroys their account.\n>>\n>> So, the \"Karma\" plugin is just infrastructure, it only maintains Karma,\n>> So, I wrote \"KarmaModerator\" to demonstrate my vision for Karma.\n>> their karma drops below 0 and emulates silencing a user when their karma\n>> At no point does it autodelete their account, but it would put them out of\n>> I could have used normal silence and sandbox, but I didn't want to\n>> That could have been the wrong thing to do, time (And Evan) will tell.\n>>\n>> As a result, there isn't really any boot strapping.\n>> nowhere. It's all currently dependent on existing karma.\n>> In this system, I'll admit, if a spammer were ever able to get a\n>> mortals.\n>> though.\n>> someone with 1000 points to even get them blacklisted.\n>> It's possible that something like blocking requires spending Karma.\n>>\n>> So, I'm planning on writing a script that takes the existing system and\n>> For example, it's probably be like \"Take the top 10 most popular accounts\n>> following all the people they're following. Then pretend that they all just\n>> all the things they've faved.\"\n>> system can take over from there with everyone else.\n>> Also, there are currently ways to game the system kind.\n>> gaining popularity slowly. (This is only possible once they have over 10\n>> A lot of the gaming I've considered involves a chain of following and\n>> I considered writing another Plugin that would implement a history for\n>> follow or unfollow them it will be that value.\n>> someone, giving them 0/10, or 0 points.\n>> with no ill intentions, it reduces their karma by 1000/10, or 100.\n>> Currently it's my feeling that only Moderators should be able to even see\n>> Other than that it's just a hidden value that most people don't even\n>> This makes it harder to game, because you can't see your progress.\n>> Anyway, this is just the first iteration.\n>>\n>> it's always easier to augment then to create.\n>> So, what do you think?\n>> StatusNet-dev mailing list\n>> http://lists.status.net/mailman/listinfo/statusnet-dev\n>\n> --\n> http://rejon.org/\n> +86.134.3957.2035 (china)\n>\n> StatusNet-dev mailing list\n> http://lists.status.net/mailman/listinfo/statusnet-dev\n> _______________________________________________\n> foaf-dev at lists.foaf-project.org\n>"}