{"subject":"[rdfweb-dev] foaf & genealogy","from":"Dan Brickley foaf-dev%40lists.usefulinc.com","cc":"","message-text":"* Danny Ayers <danny666 at v...> [2002-12-01 12:06+0100]\n> I just spotted a post on the GenealogyXML at yahoogroups.com list suggesting\n> Topic Maps for genealogy data. RDF *should* be really good for this, with\n\n+1\n\n> the one possible difficulty being how to manage the \"the gravestone says he\n> died in 2003\" kind of data given the state of contexts & reification.\n\nI reckon we can work around that, simply by adopting a document-centric \napproach to 'who said what' (just like the rest of FOAF/RDFWeb stuff does).\n\ngravestone_transcription.rdf\n...would hold an account of the world according to some gravestone, as \ntranscribed by someone. Depending on how precise you want to be, you could \nhave arbitrary levels of hairiness when representing the who/where/what etc of\nthe transcription. There is a sub-tribe of the metadata world who \nwork with 'Record Keeping Metadata' and concern themselves with accuracy about \nsuch things. We could probably learn a lot from them, while starting simple.\nInstead of trying to put everything in one super-sophisticated RDF file, we \nput 'claims from some perspective' in each file.\n\n> I reckon the bits needed for simple genealogy should sit very nicely\n> alongside FOAF, and it would allow the foafnaut to do families too.\n\nThat'd be good. There are some lists of candidate properties for foaf scattered \naround too, but nothing comprehensive yet.\n\ndan\n\n> A quick Google doesn't find much - there is an old DAML vocab at\n> http://orlando.drc.com/daml/Ontology/Genealogy/current/\n> \n> also rdf2ge12.zip RDF to GEDCOM ...\n> http://ftp.cac.psu.edu/genealogy/paf/INDEX.html\n> \n> \n> (fyi, I know close to nothing about gen. - I just thought family trees would\n> make a good example use of SVG for 'Unleashed', but it started getting too\n> big to fit in the space)\n> \n> Cheers,\n> Danny.\n> \n> -----------\n> Danny Ayers\n> \n> Semantic Web Log :\n> http://www.citnames.com/blog\n> \n> \"The lyf so short, the craft so long to lerne.\" - Chaucer\n> \n> \n> \n> \n> To unsubscribe from this group, send an email to:\n> rdfweb-dev-unsubscribe at egroups.com\n> \n> \n> \n> Your use of Yahoo! Groups is subject to http://docs.yahoo.com/info/terms/ \n>"}